Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_SRC_MIX_SLICE.h
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D5_MASK (0x700000U)
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D5_SHIFT (20U)
/*! LPM_SETTING_D5 - LPM setting of domain 5
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D5(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D5_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D5_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D6_MASK (0x7000000U)
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D6_SHIFT (24U)
/*! LPM_SETTING_D6 - LPM setting of domain 6
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D6(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D6_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D6_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D7_MASK (0x70000000U)
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D7_SHIFT (28U)
/*! LPM_SETTING_D7 - LPM setting of domain 7
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D7(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D7_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_1_LPM_SETTING_D7_MASK)
/*! @} */

/*! @name LPM_SETTING_2 - Low Power Mode Setting 2 */
/*! @{ */

#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D8_MASK (0x7U)
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D8_SHIFT (0U)
/*! LPM_SETTING_D8 - LPM setting of domain 8
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D8(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D8_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D8_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D9_MASK (0x70U)
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D9_SHIFT (4U)
/*! LPM_SETTING_D9 - LPM setting of domain 9
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D9(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D9_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D9_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D10_MASK (0x700U)
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D10_SHIFT (8U)
/*! LPM_SETTING_D10 - LPM setting of domain 10
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D10(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D10_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D10_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D11_MASK (0x7000U)
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D11_SHIFT (12U)
/*! LPM_SETTING_D11 - LPM setting of domain 11
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D11(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D11_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D11_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D12_MASK (0x70000U)
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D12_SHIFT (16U)
/*! LPM_SETTING_D12 - LPM setting of domain 12
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D12(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D12_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D12_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D13_MASK (0x700000U)
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D13_SHIFT (20U)
/*! LPM_SETTING_D13 - LPM setting of domain 13
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D13(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D13_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D13_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D14_MASK (0x7000000U)
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D14_SHIFT (24U)
/*! LPM_SETTING_D14 - LPM setting of domain 14
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D14(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D14_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D14_MASK)

#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D15_MASK (0x70000000U)
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D15_SHIFT (28U)
/*! LPM_SETTING_D15 - LPM setting of domain 15
 *  0b000..Not used. Do not write this value.
 *  0b001..power on when domain n is in RUN, off in WAIT/STOP/SUSPEND
 *  0b010..power on when domain n is in RUN/WAIT, off in STOP/SUSPEND
 *  0b011..power on when domain n is in RUN/WAIT/STOP, off in SUSPEND
 *  0b100-0b111..power always on
 */
#define SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D15(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D15_SHIFT)) & SRC_MIX_SLICE_LPM_SETTING_2_LPM_SETTING_D15_MASK)
/*! @} */

/*! @name EDGELOCK_HDSK_CTRL - Edgelock Handshake Control */
/*! @{ */

#define SRC_MIX_SLICE_EDGELOCK_HDSK_CTRL_PON_CNT_MODE_MASK (0xC000U)
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CTRL_PON_CNT_MODE_SHIFT (14U)
/*! PON_CNT_MODE - Configures the acknowledge counter for power up working mode, locked by LOCK_CFG field
 *  0b00..Not use counter, raise Edgelock handshake done to GPC once get Edgelock ack
 *  0b01..Delay after receiving Edgelock ack, delay cycle number is PON_CNT_CFG
 *  0b10..Ignore Edgelock ack, raise Edgelock handshake done to GPC when counting to PON_CNT_CFG value
 *  0b11..Time out mode, raise Edgelock handshake done to GPC when either Edgelock ack received or counting to PON_CNT_CFG value
 */
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CTRL_PON_CNT_MODE(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_EDGELOCK_HDSK_CTRL_PON_CNT_MODE_SHIFT)) & SRC_MIX_SLICE_EDGELOCK_HDSK_CTRL_PON_CNT_MODE_MASK)

#define SRC_MIX_SLICE_EDGELOCK_HDSK_CTRL_POFF_CNT_MODE_MASK (0xC0000000U)
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CTRL_POFF_CNT_MODE_SHIFT (30U)
/*! POFF_CNT_MODE - Configures the acknowledge counter for power down working mode, locked by LOCK_CFG field
 *  0b00..Not use counter, raise Edgelock handshake done to GPC once get Edgelock ack
 *  0b01..Delay after receiving Edgelock ack, delay cycle number is POFF_CNT_CFG
 *  0b10..Ignore Edgelock ack, raise Edgelock handshake done to GPC when counting to POFF_CNT_CFG value
 *  0b11..Time out mode, raise Edgelock handshake done to GPC when either Edgelock ack received or counting to POFF_CNT_CFG value
 */
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CTRL_POFF_CNT_MODE(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_EDGELOCK_HDSK_CTRL_POFF_CNT_MODE_SHIFT)) & SRC_MIX_SLICE_EDGELOCK_HDSK_CTRL_POFF_CNT_MODE_MASK)
/*! @} */

/*! @name EDGELOCK_HDSK_STAT - Edgelock Handshake Status */
/*! @{ */

#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_PON_ACK_MASK (0x1U)
#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_PON_ACK_SHIFT (0U)
/*! PON_ACK - Indicates this mix power up sequence has accepted Edgelock ack
 *  0b0..Does not get Edgelock ack for power up.
 *  0b1..Gets Edgelock ack for power up.
 */
#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_PON_ACK(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_PON_ACK_SHIFT)) & SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_PON_ACK_MASK)

#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_PON_BUSY_MASK (0x2U)
#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_PON_BUSY_SHIFT (1U)
/*! PON_BUSY - Busy requesting Edgelock handshake for power up
 *  0b0..Does not send Edgelock handshake for power up.
 *  0b1..Sends Edgelock handshake for power up.
 */
#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_PON_BUSY(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_PON_BUSY_SHIFT)) & SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_PON_BUSY_MASK)

#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_POFF_ACK_MASK (0x10000U)
#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_POFF_ACK_SHIFT (16U)
/*! POFF_ACK - Indicates this mix power down sequence has accepted Edgelock ack
 *  0b0..Does not get Edgelock ack for power down.
 *  0b1..Gets Edgelock ack for power down.
 */
#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_POFF_ACK(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_POFF_ACK_SHIFT)) & SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_POFF_ACK_MASK)

#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_POFF_BUSY_MASK (0x20000U)
#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_POFF_BUSY_SHIFT (17U)
/*! POFF_BUSY - Busy requesting Edgelock handshake for power down
 *  0b0..Does not send Edgelock handshake for power down.
 *  0b1..Sends Edgelock handshake for power down.
 */
#define SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_POFF_BUSY(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_POFF_BUSY_SHIFT)) & SRC_MIX_SLICE_EDGELOCK_HDSK_STAT_POFF_BUSY_MASK)
/*! @} */

/*! @name EDGELOCK_HDSK_CNT_CFG - Edgelock Handshake Counter Config */
/*! @{ */

#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_CFG_PON_CNT_CFG_MASK (0xFFFFU)
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_CFG_PON_CNT_CFG_SHIFT (0U)
/*! PON_CNT_CFG - Edgelock handshake ack count for power up config: usage depends on CNT_MODE, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_CFG_PON_CNT_CFG(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_CFG_PON_CNT_CFG_SHIFT)) & SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_CFG_PON_CNT_CFG_MASK)

#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_CFG_POFF_CNT_CFG_MASK (0xFFFF0000U)
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_CFG_POFF_CNT_CFG_SHIFT (16U)
/*! POFF_CNT_CFG - Edgelock handshake ack count for power down config: usage depends on CNT_MODE, locked by LOCK_CFG field */
#define SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_CFG_POFF_CNT_CFG(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_CFG_POFF_CNT_CFG_SHIFT)) & SRC_MIX_SLICE_EDGELOCK_HDSK_CNT_CFG_POFF_CNT_CFG_MASK)
/*! @} */

/*! @name EDGELOCK_HDSK_CNT_STAT - Edgelock Handshake Counter Status */
/*! @{ */

