Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_SRC_MIX_SLICE.h
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PDN_CACHE_MASK (0x70000U)
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PDN_CACHE_SHIFT (16U)
/*! MLPL_HW_PDN_CACHE - Memory(MEM Type II or MEM Type I's CM33PLATFORM_CACHE or CM7PLATFORM_CACHE,
 *    depending on which MIX of the register) low power level when hw power down
 */
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PDN_CACHE(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PDN_CACHE_SHIFT)) & SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PDN_CACHE_MASK)

#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PUP_CACHE_MASK (0x700000U)
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PUP_CACHE_SHIFT (20U)
/*! MLPL_HW_PUP_CACHE - Memory(MEM Type II or MEM Type I's CM33PLATFORM_CACHE or CM7PLATFORM_CACHE,
 *    depending on which MIX of the register) low power level when hw power up
 */
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PUP_CACHE(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PUP_CACHE_SHIFT)) & SRC_MIX_SLICE_MLPL_CFG_MLPL_HW_PUP_CACHE_MASK)

#define SRC_MIX_SLICE_MLPL_CFG_MLPL_SW_CACHE_MASK (0x70000000U)
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_SW_CACHE_SHIFT (28U)
/*! MLPL_SW_CACHE - Memory(MEM Type II or MEM Type I's CM33PLATFORM_CACHE or CM7PLATFORM_CACHE,
 *    depending on which MIX of the register) low power level when sw trigger memory update power level
 */
#define SRC_MIX_SLICE_MLPL_CFG_MLPL_SW_CACHE(x)  (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_CFG_MLPL_SW_CACHE_SHIFT)) & SRC_MIX_SLICE_MLPL_CFG_MLPL_SW_CACHE_MASK)
/*! @} */

/*! @name MLPL_STAT - Memory Low Power Level Status */
/*! @{ */

#define SRC_MIX_SLICE_MLPL_STAT_CURRENT_MLPL_LMEM_MASK (0x7U)
#define SRC_MIX_SLICE_MLPL_STAT_CURRENT_MLPL_LMEM_SHIFT (0U)
/*! CURRENT_MLPL_LMEM - Current memory (MEM Type I with PSW or MEM Type I except for
 *    CM33PLATFORM_CACHE or CM7PLATFORM_CACHE, depending on which MIX of the register) low power level
 */
#define SRC_MIX_SLICE_MLPL_STAT_CURRENT_MLPL_LMEM(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_STAT_CURRENT_MLPL_LMEM_SHIFT)) & SRC_MIX_SLICE_MLPL_STAT_CURRENT_MLPL_LMEM_MASK)

#define SRC_MIX_SLICE_MLPL_STAT_LMEM_BUSY_MASK   (0x8U)
#define SRC_MIX_SLICE_MLPL_STAT_LMEM_BUSY_SHIFT  (3U)
/*! LMEM_BUSY - Busy requesting low power level of memory (MEM Type I with PSW or MEM Type I except
 *    for CM33PLATFORM_CACHE or CM7PLATFORM_CACHE, depending on which MIX of the register)
 */
#define SRC_MIX_SLICE_MLPL_STAT_LMEM_BUSY(x)     (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_STAT_LMEM_BUSY_SHIFT)) & SRC_MIX_SLICE_MLPL_STAT_LMEM_BUSY_MASK)

#define SRC_MIX_SLICE_MLPL_STAT_CURRENT_MLPL_CACHE_MASK (0x70U)
#define SRC_MIX_SLICE_MLPL_STAT_CURRENT_MLPL_CACHE_SHIFT (4U)
/*! CURRENT_MLPL_CACHE - Current memory (MEM Type II or MEM Type I's CM33PLATFORM_CACHE or
 *    CM7PLATFORM_CACHE, depending on which MIX of the register) low power level
 */
#define SRC_MIX_SLICE_MLPL_STAT_CURRENT_MLPL_CACHE(x) (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_STAT_CURRENT_MLPL_CACHE_SHIFT)) & SRC_MIX_SLICE_MLPL_STAT_CURRENT_MLPL_CACHE_MASK)

#define SRC_MIX_SLICE_MLPL_STAT_CACHE_BUSY_MASK  (0x80U)
#define SRC_MIX_SLICE_MLPL_STAT_CACHE_BUSY_SHIFT (7U)
/*! CACHE_BUSY - Busy requesting low power level of memory (MEM Type II or MEM Type I's
 *    CM33PLATFORM_CACHE or CM7PLATFORM_CACHE, depending on which MIX of the register)
 */
#define SRC_MIX_SLICE_MLPL_STAT_CACHE_BUSY(x)    (((uint32_t)(((uint32_t)(x)) << SRC_MIX_SLICE_MLPL_STAT_CACHE_BUSY_SHIFT)) & SRC_MIX_SLICE_MLPL_STAT_CACHE_BUSY_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SRC_MIX_SLICE_Register_Masks */


/*!
 * @}
 */ /* end of group SRC_MIX_SLICE_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SRC_MIX_SLICE_H_ */

